[
  {
    "title": "General Rules",
    "link": "#general_rules",
    "isSubtitle": false,
    "rules": [
      "It is your responsibility to remain informed of any rule changes on our website or Discord.",
      "You are not allowed to play any content that is under copyright protection (DMCA), such as DMCA protected movies and music.",
      "You must have a working, clear microphone.",
      "Erotic Roleplay (ERP) is not allowed. This includes posting nudity and lewd content.",
      "Do not influence others to break rules, you will receive a similar punishment.",
      "Do not use any real-life events in the city. No suicide RP, real-life terrorism threats, pandemics or mental illnesses.",
      "You cannot stop roleplay if something happens that you do not like. All parties must agree to it.",
      "Never use an explicit or offending name on any EchoRP platforms.",
      "No racism, trolling, homophobia and sexism.",
      "Treat each other with respect, everyone is equal.",
      "Any sort of discrimination is not tolerated, this may result in a permanent removal on the first offense.",
      "Using derogatory terms such as, but not limited to the word “retard”, is a bannable offense.",
      "Attacking members in other Discord servers, YouTube, Twitter, etc. is prohibited and punishable.",
    ]
  },
  {
    "title": "Account & Donations",
    "link": "#account_and_donations",
    "isSubtitle": false,
    "rules": []
  },
  {
    "title": "Account",
    "link": "#account",
    "isSubtitle": true,
    "rules": [
      "Anything that occurs on your account is your responsibility.",
      "It is prohibited to buy or sell accounts and/or valuables from another user other than the server owner for packages. The community is not accountable for scams and/or permanent death/bans of accounts or characters.",
      "Should you lose access to your Discord account, we are not able to transfer the Allowlist status to another Discord"
    ]
  },
  {
    "title": "Donations",
    "link": "#donations",
    "isSubtitle": true,
    "rules": [
      "All donations/purchases are permanent and non-refundable. If there has been a mistake or any other circumstance, please contact Flawws (owner) immediately.",
      "All purchases/donations are tied to your account and you will be asked what character you want the donation perks given too. You cannot change your mind in the future once they are given or transfer them after.",
      "In a situation, where a buyer is banned for violating the server rules, any purchases made by the buyer will not be refunded, remember that buyers are held responsible for their actions, just as any other player.",
      "In the instance of a chargeback, you will not be allowed to appeal any bans resulting from violating server rules.",
      "The selling of any item gained from donating is not allowed."
    ]
  },
  {
    "title": "Character",
    "link": "#character",
    "isSubtitle": true,
    "rules": [
      "Players are not allowed to create new characters with the intent to transfer the starter money over to another character. All involved parties breaking this rule will have all their money revoked from them and banned. You are also not allowed to transfer any assets your character has accumulated to any other character for any reason.",
      "Police, DOC & EMS are not allowed to be corrupt. An example of such would be giving away or selling equipment.",
      "Make sure you separate your characters. They do not know each other, they do not know where your weed location is, who your friends/enemies are, etc... Other characters you create are not your “cousin”",
      "Anything in Discord that starts with RP- is in character. I.e #rp-instagram. Anything posted there means evidence or subject for search and can be used as proof.",
      "When you are incapacitated and taken to the hospital, revived by pressing E, you must not return to the RP scenario you were previously in for at least 60 mins.",
      "You are not allowed to have multiple characters that are affiliated with the same circle/gang. You must separate your RP.",
      "If a player has a camera on their character, they can use recordings as legal evidence, otherwise, they cannot.",
      "Serial Killers/Robots/Paranormal Characters, etc must be approved by the staff team via a Discord ticket.",
      "We may remove your property (such as, but not limited to, vehicles and houses) if you have not returned to the server after ~90 days. If you are logging in like once a week to bypass this, we will ignore the login.",
      "Indicating that you have no pulse three or more times, will result in permanent death of your character."
    ]
  },
  {
    "title": "Cheating & Exploiting",
    "link": "#cheating_and_exploiting",
    "isSubtitle": false,
    "rules": []
  },
  {
    "title": "Game Modifications, Cheating & Macros",
    "link": "#gamemodifications_cheating_macros",
    "isSubtitle": true,
    "rules": [
      "It is strictly prohibited to use any game modifications and enhancements that can give a player an unfair advantage, such as increased speed, no night visual packs, gumballs, health regeneration, and teleportation (Not limited to theses examples). A player caught cheating will be permanently banned without any prior warning.",
      "Players are allowed to use visual enhancements or other game modifications that do not give the user an advantage which can be classed as cheating or unfair. Binding keys to server commands or text messages for faster and more convenient access is permitted.",
      "Macroing is the act of using third-party software or hardware enhancements that enable the player to perform automated actions. Macroing to perform activities for a financial benefit or to circumvent the AFK script is a bannable offence. All property and experience gained through macroing will be revoked."
    ]
  },
  {
    "title": "Exploiting Bugs",
    "link": "#exploiting_bugs",
    "isSubtitle": true,
    "rules": [
      "Exploiting client and/or server bugs is stricly prohibited. Abusing an exploit will result in a ban. Anything gained from an exploit will also be removed.",
      "Camping animal and vehicle spawns are a form of exploitation. Allow things to occur naturally, do not go back and forth from a known spot knowing that an animal will appear.",
      "Circumventing the emote cooldown by using the F8 menu or any other method is not allowed.",
      "All bugs must be reported on the Discord!"
    ]
  },
  {
    "title": "Communication",
    "link": "#communication",
    "isSubtitle": false,
    "rules": []
  },
  {
    "title": "Communication Procedures",
    "link": "#communication_procedures",
    "isSubtitle": true,
    "rules": [
      "Refusal to communicate with other players in English will result in a ban.",
      "Players are allowed to speak to each other in another language through personal messages or in other personal, non public spaces.",
      "Any kind of advertising of other GTA V communities or cyber threats is forbidden on all servers and channels. Malicious advertisements or cyber threats aimed at hurting the community will result in a permanent ban.",
      "Do not spam identical or meaningless messages multiple times, including /me, do not spam server commands multiple times, and do not spam game unrelated irritating sounds using voice-chat.",
      "In-character offensive language, threats are allowed, however, insulting another character gives them a roleplay reason to take hostile action against your character. Racism/Sexual harassment is not allowed in character or outside character.",
      "Any kind of out-of-character offensive language, threats or racism is prohibited. You cannot make death threats to living people, death threats aimed at living people will result in much harsher punishments.",
      "Excessively screaming swear words at people or a person is not tolerated.",
      "A staff member has the right to request that a player stops offending another player’s character if the administrator thinks that the in-character exception for offensive language is being abused.",
      "People who are bringing low quality mic/voice changers will be brought into a ticket where we can help to fix the issue if it is unintentional, or so we can help give tips for clarity with voice changers.",
      "Bad Faith Rule - Purposefully being combative towards staff or causing unnecessary issues can be grounds for your removal from the community."
    ]
  },
  {
    "title": "OOC Terminology",
    "link": "#ooc_terminology",
    "isSubtitle": true,
    "rules": [
      "OOC talk can be done in Discord and is prohibited while in game.",
      "Do not use any immersion breaking words.",
      "You are not allowed to mention other “cities/counties” under any circumstance.",
      "Referring to other characters, where it be your own or not, as \"cousins, alter ego, etc.\" is never allowed.",
      "Using \"the government\" or \"look to the skies\" (not limited to these examples) to refer to staff is a bannable offence.",
      "Talking \"spiritually\" makes no sense and is also a form of OOC terminology.",
      "Please keep the flow of RP by rolling with any sort of bug (cars being “ghosted”, saying a robbery or another script is \"scuffed\" while in-character) and report it afterwards.",
      "Using words as \"weird\" or \"strange\" to target or describe someones Roleplay."
    ]
  },
  {
    "title": "Report",
    "link": "#report",
    "isSubtitle": true,
    "rules": [
      "Players should use the Discord ticketing system to report players, whether it be a past or present incident.",
      "All necessary information and evidence must be given with the report.",
      "Please allow up to a week for your report to be processed, though the usual turnaround is 24 hours.",
      "If a player thinks that a staff member is abusing their powers, the player may submit a player report using a Discord Ticket.",
      "Personally messaging a staff member will not result in a satisfactory response, you may be ignored or forwarded to a ticket.",
      "Staff members can request players to halt all actions in a roleplay situation if the server rules have been or are currently being broken. This is done through a Discord ticket."
    ]
  },
  {
    "title": "Crime & Gangs",
    "link": "#crime_assassinations_situations_gangs",
    "isSubtitle": false,
    "rules": []
  },
  {
    "title": "Gangs",
    "link": "#gangs",
    "isSubtitle": true,
    "rules": [
      "Gangs are not all about running around and shooting each other so please do not feel that every gang has to be hostile and cause problems, be original and creative.",
      "Initiate before shooting. You are expected to roleplay and use your words, even if \"beef\" occurs over social media, you are still expected to RP in person.",
      "All information for gangs and on how to apply can be found in the Gang Handbook: https://gangbook.echorp.net",
      "You cannot sit idle at delivery, start, etc... spots when taxing",
      "To identify/catch people doing the job which you tax for, you must put in a considerate amount of effort and provide a high quality Roleplay experience for all parties involved. An example of not doing this is pulling up to a van aiming guns out of your car asking them to pay.",
      "At any time, staff can revoke taxing for a specific job if the overall reward made from taxing an absurd amount."
    ]
  },
  {
    "title": "Criminal Activities",
    "link": "#criminal_activities",
    "isSubtitle": true,
    "rules": [
      "The set limit to doing a criminal activity is 5 criminals. The term \"criminal activities\" refers to anything that is breaking a law, not limited to robberies.",
      "5-man rule - Criminal activities are limited to 5 players max at a time. This means that no outside help is allowed in any sort of way. Whoever you bring to the scenario is who you have until it is completely played out. This includes anyone giving information to the scenario (lookouts, radio comms, etc.). Gangs are not allowed to take a scenario to their turf or near their turf where they would be in violation of the 5 man rule.",
      "Mechanics can not use their F1 menu or any other ability gained by the job during criminal activities.",
      "Separate groups cannot work together and hit different objectives together. Both groups must adhere to the respective timer.",
      "Prison Transports are considered a separate scenario than the original scenario that caused the arrest. You are allowed a new group of five when attacking the transport.",
      "Fake hostages are not allowed. You must plan robberies the correct way!",
      "Fleeca, bank trucks, G6, Paleto Bank and the Pacific Standard Vault require you to have an in-depth robbery plan. An example of a not-so-in-depth robbery would be getting in a car and driving until you lose the cops. Be creative!",
      "After commiting a store robbery/car boost, you must impose a self-cooldown of 45 mins, likewise... Vangelico and the Art Gallery are 90 Mins, Bank Trucks/Fleeca Robberies/Drug Runs are 120 Mins, Paleto Bank/Pacific Standard is 180 Mins, These cooldowns are not individual. For example, if you hit a Fleeca Bank, you cannot go rob a store right after. You must wait out the full cooldown before participating in any other robbery mentioned before.",
      "Players are allowed to rob other players by either roleplaying it or by forcing them to raise their hands. There is no limit on how much money or items you can take from a single robbery.",
      "Scamming must be done in-game by roleplaying it. Scamming people through out-of-character channels is not allowed, this includes scamming someone by telling them the incorrect server command for personal gain.",
      "Any scams involving accessing any menus or teleporting (excusing the F2 inventory menu) is prohibited.",
      "If a vital part of your scam is relying on a server function not working properly, it is not allowed. You cannot use a server mechanic to your advantage.",
      "Any place with a \"teleport\" are places you are prohibited to rob players.",
      "You cannot interfere in robberies. For example, if X is doing a Pacific Standard heist, you cannot enter the bank without permission from X party. A gang is allowed to interfere with a store robbery if the establishment that is being robbed falls within their turf. You are also not allowed to interfere under the reasoning of \"revenge\", this includes, but is not limited to interferring because your friend was taken hostage",
      "You may choose to follow people who have just robbed the bank with the intention to rob the money for yourself. You must, however, have RP before resorting to shootouts.",
      "You cannot rob government employees (PD, DOJ, EMS) strictly for the purpose of obtaining their belongings.",
      "You are not allowed to rob Pacific Standard, Paleto Bank, Fleeca Banks, and Vangelico Jewelry Store 60 minutes before restart and 30 minutes post restart.",
      "You are not allowed to commit all other crime 30 minutes before and after server restart, including house robbing, selling drugs, robbing other players, shooting weapons, etc.",
      "In the event of an unscheduled server restart or server crash, wait 15 minutes before committing any crimes.",
      "Camping or staking out an area where you can start/commit a crime is not allowed. You are allowed to check the area/availability, but afterwards you must leave the area for at least 5 minutes before returning.",
      "Shooting cooldown, regardless of scenario type, is 90 mins."
    ]
  },
  {
    "title": "Roleplay Rules",
    "link": "#roleplay_rules",
    "isSubtitle": false,
    "rules": []
  },
  {
    "title": "Off-Limits Areas",
    "link": "#offlimits_areas",
    "isSubtitle": true,
    "rules": [
      "Fort Zancudo and the aircraft carriers are off-limits, anyone caught violating this rule will be dealt with accordingly. You would not have access to this place in real life, as it is a highly secured area."
    ]
  },
  {
    "title": "Deathmatch, Revenge Killing & Kill On Sight",
    "link": "#deathmatch_revenge_killing_kos",
    "isSubtitle": true,
    "rules": [
      "RP needs to be initiated before a shootout begins.",
      "You are allowed to attack another player if they try to hurt you or damage your property intentionally, if they ignore your threats and attempt to resist or if they try to take hostile action against you.",
      "Random Deathmatch (RDM): The act of killing or hurting another player or damaging their property intentionally by use of any force without having a valid in-character reason to do that.",
      "Vehicle Deathmatch (VDM): The act of killing, hurting another player or damaging their property intentionally by using a vehicle without having a valid in-character reason to do that. Intentionally running over another individual with a valid in-character reason can still be considered LQRP."
    ]
  },
  {
    "title": "New Life Rule (NLR)",
    "link": "#new_life_rule",
    "isSubtitle": true,
    "rules": [
      "New Life Rule: Triggered once you are incapacitated and respawn at the hospital, the cause of death is irrelevant. Getting yourself downed is not considered as dying, therefore once you get treated by EMS, the new life rule is not triggered. You lose all memory from the scenario if you respawn by using “E”.",
      "After you are incapacitated, you cannot talk about your death through in-character channels unless an individual/party informs you through RP.",
      "Once a player becomes incapacitated, they cannot come back to the area of their death for 30 minutes and they cannot take hostile action against the party responsible for their death for 60 minutes, they also lose every roleplay reason to take hostile action against the party responsible for their death.",
      "Another player is not able to decide when another permanently kills their character, this is decided upon OOC and once agreed they can commence with the scenario. You are allowed to plan out a scenario OOC if you decide on permaing your character.",
      "If you are downed in a scenario and it has ended, you are not allowed to return to the area of the scene to collect evidence, loot bodies, etc."
    ]
  },
  {
    "title": "Combat & Roleplay Logging",
    "link": "#combat_roleplay_logging",
    "isSubtitle": true,
    "rules": [
      "Players are not allowed to disconnect or respawn from a roleplay or combat situation that could have in-character consequences. This includes respawning during an active scenario",
      "If your game crashes, you must reconnect to the server and continue roleplaying the scenario that you were in.",
      "Whilst in combat, you are not allowed to use emotes (such as passout, sleep, etc...) to your advantage."
    ]
  },
  {
    "title": "Metagaming, Powergaming & Torture RP",
    "link": "#metagaming_powergaming_torturerp",
    "isSubtitle": true,
    "rules": [
      "Metagaming: This is when you use real-life information gained from outside the bounds of the game to benefit your character's knowledge in-game, even though they would not have known this information. For example, watching a stream to find someone’s location to use for your personal benefit, or using the “M” name tags and finding out who it is.",
      "Metagaming to gain an in-game advantage, for example, requesting help from your allies through out-of-character channels, will result in more severe punishments, than accidental metagaming, that serves no benefit to the player, such as calling a stranger by his character name.",
      "Whilst you are in the city, under no circumstances, are you allowed to be in a livestream (such as, but not limited to, Discord, Twitch, Facebook Gaming & Youtube) of someone else who is also in the city.",
      "Powergaming: Roleplaying with mechanics/abilities that do not exist or forcing someone else into a situation where they do not have choices.",
      "Using /me to force RP in your favor rather than leaving it open ended for all parties involved.",
      "Kicking from bikes is not allowed.",
      "Putting a stash or other furniture outside the shell of a player owned property so it is no longer visible is not allowed.",
      "Unnecessarily escorting, cuffing, or carrying someone. This includes doing these to gain an advantage of someone who is not in the downed state.",
      "Using a vehicle to flip over another vehicle.",
      "You must never spam the attacking/melee button on someone.",
      "Roleplaying something unrealistically ridiculous or forcing roleplay actions on other players by using the /me command is not allowed and is classed as powergaming.",
      "Dragging a player around with the intent to not create RP and/or to annoy them, is a bannable offence.",
      "Torture RP - You must receive consent from the other party that you are torturing through a /me to ensure they are ok with the actions happening to their character. If the player you are torturing responds with “/me Not ok with that” etc. you must attempt to end the scenario in a timely manner without pursuing more torture RP.",
      "Use of vehicles with unbreakable windows, extremely small windows, covered fronts, or provide an advantage in shootouts can not be used for criminal activity.",
      "Use of third party VOIP is strictly prohibited while you are connected to the server. (Skype, Discord, Zoom, etc.)",
      "Under no circumstances can a criminal force his victim to sell his property, such as houses, vehicles or businesses",
      "You are not allowed to demand someone to hand over ownership of their vehicle but they can however demand the spare keys to a vehicle (F1 menu/vehicle/givekey).",
      "Demainding someone to withdraw money from their bank account via an ATM, bank or phone is not allowed.",
      "Forcing someone to use a crafting/buy station is considered powergaming"
    ]
  },
  {
    "title": "Prison Roleplay",
    "link": "#prison_roleplay",
    "isSubtitle": true,
    "rules": [
      "As a prison lifer, breaking out of prison is not allowed unless approved by staff. You can obtain approval via a ticket. As a lifer, you are expected to play the role, not snake your way out after a couple of weeks.",
      "You should always RP as if their are DOC around even if no players are online.",
      "Breaking into prison without a purpose or a plan is LQRP or leaving the prison using the teleport mechanic at the interaction booth when not a prisoner.",
      "EMS is allowed to transport you out of the prison to conduct medical that cannot be conduced in the prison's medical center"
    ]
  },
  {
    "title": "Private Discords",
    "link": "#private_discords",
    "isSubtitle": true,
    "rules": [
      "All EchoRP related discords featuring in character channels must follow all EchoRP Rules and Guidelines.",
      "The owner of said private discord must properly outline which channels are in character channels.",
      "Businesses discord's must place their Discord invite link in their documents channel within the Main EchoRP Business Discord.",
      "Gangs with discords must place their links in their sections within the Main EchoRP Gang Discord.",
      "If requested, staff can request access to your EchoRP related discord, and must be given administrative access to ensure of no metagaming. Refusal will effect your business or gang.",
      "Any Discord related to Echo with over 100 members must be owned by an EchoRP admin+",
      "You must be able to provide proper and full screenshots of discord conversations if staff is to request them as evidence for a report.",
      "You cannot remove a staff member (that is there to supervise) from an EchoRP related discord via a kick or ban. (Unless said staff member is no longer apart of your group or gang.)"
    ]
  },
  {
    "title": "Imports",
    "link": "#imports",
    "isSubtitle": true,
    "rules": [
      "Your character cannot own more than two imports (exc. vin scratches) under any circumstances.",
      "Businesses are allowed to go over the import limit for raffles."
    ]
  },
  {
    "title": "Roleplay Quality",
    "link": "#roleplay_quality",
    "isSubtitle": false,
    "rules": [
      "Cop baiting is a great form of low quality Roleplay. This is where you purposefully attempt to bait Police Officers into a scenario without any RP behind it. Ex. Hitting a cop car to have them chase you to an ambush for the purpose of a gunfight.",
      "Please refrain from playing “money simulator”. This can also come in the form of not interacting with other individuals and prioritizing monetary gains rather than interactions.",
      "Refusing to respond to EMS staff may result in a kick from the server, please refer to the following- https://docs.google.com/document/d/1s7ptrNFOnhOTY75unmooOu6fpzaQmBBNk9GAQSvoWUo/edit",
      "Strictly no salty and toxic behaviour. Examples include repeated mag dumping into a downed body, playing loud music, screaming over the microphone, spitting and emoting on downed bodies, \"Spinning till they don't wake up\" and Twitter drama.",
      "No hospital camping to rub salt in the wounds if you win or lose a fight.",
      "Scenes are to be used to enhance RP through giving context to a scene, not to paint \"StreetK\" everywhere!",
      "Criminals must provide a proper reasoning during initiation before shooting police officers, especially during mag dump season.",
      "Randomly blowing up vehicles is prohibited without proper initiation."
    ]
  },
  {
    "title": "Fail/Low Quality Roleplay (LQRP, FRP)",
    "link": "#fail_low_quality_roleplay",
    "isSubtitle": true,
    "rules": [
      "FailRP/Low Quality RP: Actions that are unrealistic or hurt the roleplay experience of other players are considered as fail roleplay, however, not all actions that may seem unrealistic are punishable.",
      "Example of LQRP/FRP: Taking an enemy vehicle and stripping the upgrades off of it.",
      "Example of LQRP/FRP: Failing to respond to /me interactions of other players, such as /me takes off mask or /me steals shoes.",
      "Example of LQRP/FRP: Talking normally after you have gunshot wounds. To avoid salt, attempt to RP your injuries out by screaming rather than engaging in conversation with the other party. This includes giving communications while down.",
      "Example of LQRP/FRP: Using a tazer to pop a tire of a vehicle",
      "Example of LQRP/FRP: Spectating any shootout.",
      "Example of LQRP/FRP: Robbing someone without reason or sufficient roleplay (inc. cops)",
      "Example of LQRP/FRP: Using the same shootout location in a short amount of time."
    ]
  },
  {
    "title": "Value of Life",
    "link": "#value_of_life",
    "isSubtitle": true,
    "rules": [
      "Value Of Life: You must value your life similar to the way you do your own life in real life. For example, you must not engage in a gunfight for the fun of it, knowing that you would not do it IRL. At all times you must value your life as if it were your last. If you are at a clear disadvantage, for example, a gun pointed to the back of your head whilst you are looking the other direction, you must comply with their demands.",
      "If you are outnumbered 3 to 1 you must comply. This does not mean that you do not have an option to try and escape. When possible and in a correct situation, you have the option to try and escape.",
      "A bad example of an attempt to escape is if you are being held hostage in front of a bank and decide to run away even though the person has a firearm ready."
    ]
  }
]
